# SymbolId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolGeometryId..::..SymbolId Property
SymbolGeometryId Class See Also
---
The id of the symbol that is containing the shared geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ElementId SymbolId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SymbolId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ SymbolId {
	ElementId^ get ();
}
```

# See Also
SymbolGeometryId Class
Autodesk.Revit.DB Namespace